const artworks = [
    { 
      image: "1", 
      artname: "WHO CARES ?", 
      artist: "ฐิติวรดา ตานะ" ,
      noumber: "4",
      description: "หากมัวแต่แคร์สายตาคนอื่น ชีวิตนี้คงไม่ได้ทำอะไรพอดี แทนที่จะทำแบบนั้น สู้ทำสิ่งที่ตัวเองชอบโดยไม่เดือดร้อนคนอื่นก็พอ ทัศนะธาตุ ใช้เส้นโค้งอิสระ , เส้นตรง , รูปร่างเรขาคณิต , รูปร่างอิสระ , สร้างศิลปะแบบลดถอนอย่างศิลปิน Picasso และเลือกสีพื้นหลังเป็นโทนร้อนเพื่อสื่อถึงอารมณ์ของผู้คน และใช้สีโทนเย็นตัดเพื่อแสดงให้ถึงความใจเย็นและสบายถึงจะโดนความร้อนรอบๆก็ตาม", 
      
    },

    { 
      image: "2", 
      artname: "The Parallel", 
      artist: "ภูวนัส วิริญานนท์" ,
      noumber: "38",
      description: "เป็นการสะท้อนรูปพีระมิดจากน้ำ", 
      
    },

    { 
      image: "3", 
      artname: "The Jew Hater", 
      artist: "ยินดี สืบทายาท" ,
      noumber: "23",
      description: "ชายที่ถูกกดขี่และลุกขึ้นเพื่อทวงคืนเสรีภาพของเขาและชาวเมืองที่ถูกช่วงชิงไปคืนมา เขาคือ “ อดอวฟ์ ฮิทเลอร์ “  - เป็นภาพตัดทอนจากศิลปินแบบปิกัซโซ่", 
      
    },

    { 
      image: "4", 
      artname: "The girl inside", 
      artist: "วีร์รดา แก้วกันใจ" ,
      noumber: "16",
      description: "เป็นภาพเกี่ยวกับความรู้สึกของมนุษย์ โดยในภาพมีดวงตาแทนสายตาของคนมากมายที่จับจ้องมาตลอด และปากแทนคำพูดของหลายๆคน ซึ่งอาจส่งผลให้เกิดความกดดัน ไม่มีความสุข ความคิดยุ่งเหยิ่ง แต่ไม่สามารถแสดงออกมาได้", 
      
    },

    { 
      image: "5", 
      artname: "The dream boy", 
      artist: "ณัฐดนย์ ปัญญาแม" ,
      noumber: "7",
      description: "เด็กชายผู้มีความฝันที่จะทำให้ตนเองขึ้นเป็นใหญ่เพื่อนำความสงบสุขมาแก่ประเทศ หลักการสร้างภาพคือ ใช้เส้นโค้งเพื่อสื่อถึงความเจริญก้าวหน้า นำเส้นโค้งคดมาใช้วาดก้อนเมฆทำให้เกิดความรู้สึกเคลื่อนไหว ใช้สีโทนร้อนในการระบายพื้นหลังสื่อถึงยามพลบค่ำให้เกิดความรู้สึกอบอุ่น", 
      
    },

    { 
      image: "6", 
      artname: "The counlryside", 
      artist: "ชยกร วิบุลกิติ์" ,
      noumber: "25",
      description: "ความแตกต่างระหว่างชุมชนเมืองกับชนบท ความแตกต่างความเจริญ และการวาดภาพแบบปิกัสโซ่", 
      
    },

    { 
      image: "7", 
      artname: "The chaos", 
      artist: "ธีระกรินทร์ ทองเพ็ญ" ,
      noumber: "33",
      description: "ความวุ่นวายของการลงสี โดยการผสมสีหลายๆสี ใช้เส้นตรงในการตัดเส้น ใช้รูปเรขาคณิต ทั้งสามเหลี่ยม สี่เหลี่ยม และหกเหลี่ยม เป็นภาพที่ได้รับแรงบันดาลใจจาก picasso ทัศนธาตุ เส้นตรง เส้นโค้ง เส้นโค้งให้ความรู้สึกอิสระ ลื่นไหล เป็นธรรมชาติ เส้นตรงให้ความรู้สึกแข็งแกร่ง และแข็งกร้าว", 
      
    },

    { 
      image: "8", 
      artname: "Sunset with cold duck", 
      artist: "ธัญกันณ์ จอมชาญพันธ์" ,
      noumber: "27",
      description: "เป็ดที่ระบายที่ระบายด้วยโทนเย็นปนโทนร้อน โดยสีโทนเย็นเป็นสีเป็ด และสีโทนร้อนเป็นสีของพระอาทิตย์ตก ในแบบลดทอนตามศิลปินปิกัสโซ่", 
      
    },

    { 
      image: "9", 
      artname: "Sunflower", 
      artist: "จารุพิชญา คำลือ" ,
      noumber: "29",
      description: "ฤดูร้อนเป็นฤดูที่ดอกทานตะวันชอบ ฤดูนี้ทำให้ดอกทานตะวันเบ่งบาน และสวยงามในแบบที่มันควรเป็น เปรียบทานตะวันเป็นดั่งผู้คน ผู้คนควรอยู่ถูกที่ถูกเวลา จึงจะมีคุณค่าและความสำคัญ โดยใช้เทคนิคลดทอนตามศิลปินปิกัสโซ่", 
      
    },

    { 
      image: "10", 
      artname: "Strawtallien", 
      artist: "วรรณศิลป์ แชโต" ,
      noumber: "35",
      description: "ได้รับแรงบันดาลใจจากสไตล์ของ Picasso จึงได้ถ่ายทอดออกมาเป็นเด็กผู้ชายคนนึงที่ชอบกินสตรอว์เบอร์รี่ วันๆกินแต่สตรอว์เบอร์รี่ วันๆกินแต่สตรอว์เบอร์รี่ ไม่ยอมทำอะไรจนหัวกลายเป็นสตรอว์เบอร์รี่จนทุกคนมองว่าเป็นตัวประหลาดแล้วหนีออกไปนอกโลก และต้องปลอมตัวเป็นเอเลี่ยนเพื่อไม่ให้โดนจับกิน", 
      
    },

    { 
      image: "11", 
      artname: "Red guitar", 
      artist: "ณัฐวุฒิ ขาวคม" ,
      noumber: "24",
      description: "เป็นภาพกีตาร์ที่ดูธรรมดา แต่มีความเร่าร้อนในภาพ มีความรู้สึกว่างๆ แต่ก็รู้สึกร้อน ใช้เทคนิคศิลปินปิกัสโซในการวาดภาพ", 
      
    },

    { 
      image: "12", 
      artname: "My trees", 
      artist: "เอกภวิษย์ สันบุญเป็ง" ,
      noumber: "30",
      description: "เป็นผลงานที่ผมคิดขึ้นมาตอนที่ได้นึกถึงตอนไปเล่นน้ำแล้วเจอต้นไม้2ต้น", 
      
    },

    { 
      image: "13", 
      artname: "mood light", 
      artist: "ดนิสา พชรพิพัฒน์" ,
      noumber: "15",
      description: "เป็นการเปรียบเทียบบรรยากาศระหว่างการที่ต้องอยู่คนเดียวที่ล้อมรอบผู้คนกับการอยู่คนเดียวที่ไม่มีใคร", 
      
    },

    { 
      image: "14", 
      artname: " MASK N RIBBON", 
      artist: "อาทิตยา ธีโรภาส" ,
      noumber: "18",
      description: "เป็นรูปแนวตัดทอนที่ได้รับแรงบันดาลใจจาก Picasso ศิลปินท่านหนึ่ง", 
      
    },

    { 
      image: "15", 
      artname: "Mask life", 
      artist: "ภูษณิศา นิ่มเจริญดี" ,
      noumber: "27",
      description: "เป็นคนที่ต้องคอยใส่หน้ากากและสร้างตัวตนใหม่เสมอเพื่อปกปิดสิ่งต่าง ๆ และทำให้ตนเองเป็นคนที่คนอื่นชื่นชอบ/สวย ซึ่งตนเองตอนใส่หน้ากากก็เปรียบเป็นด้านสว่าง และตัวตนที่แท้จริงเปรียบเหมือนด้านมืด ทัศนะธาตุภาพนี้คือ แบ่งใช้สีโทนร้อน/เย็นอย่างชัดเจน ใช้เส้นโค้งทำให้ดูมีชีวิตชีวามากขึ้น ภาพนี้เป็นภาพลดทอนเส้นตามศิลปิน Picasso", 
      
    },

    { 
      image: "16", 
      artname: "Mask Girl", 
      artist: "นวนันท์ กฤตธนานันท์" ,
      noumber: "42",
      description: "ได้แรงบันดาลใจมาจาเรื่อง Mask Girl ผู้หญิงต้องใส่หน้ากากเพื่อปกปิดใบหน้าที่ไม่ตรง Beauty Standard ของเกณฑ์ที่ตั้งไว้", 
      
    },

    { 
      image: "17", 
      artname: "How Do You Feel", 
      artist: "สมิตานันท์ แก้วมา" ,
      noumber: "43",
      description: "ได้รับแรงบันดาลใจมาจากชีวิตของคนเราที่วันหนึ่งมีหลายอารมณ์ความรู้สึกทั้งความรู้สึกโกรธ อิจฉาริษยา การมีความสุข ความเสียใจ แต่ต้องแสดงความรู้สึกที่โอเคปกติออกมา แม้ข้างในใจจะกังวลมากแค่ไหน", 
      
    },

    { 
      image: "18", 
      artname: "Hide My Face", 
      artist: "พัณณิตา จุมดวง" ,
      noumber: "9",
      description: "คนเราเวลาเศร้าจะไม่แสดงออกให้คนอื่นเห็นแต่เราจะแสดงด้านยิ้มแทนตลอดและจะมีเทวดาประจำตัวเราที่จะเห็นภายในจิตใจเราตลอดเวลา", 
      
    },

    { 
      image: "19", 
      artname: "hidden identity", 
      artist: "สิปราง วงศ์สิทธิพิศาล" ,
      noumber: "26",
      description: "ทุกคนย่อมมีหลากหลายบุคลิกที่อยู่ในตัว ซึ่งอาจไม่ได้เปิดเผยออกมา สร้างศิลปะในรูปแบบลดทอนตามปิกัสโซ่", 
      
    },

    { 
      image: "20", 
      artname: "Gorlock the friend eater", 
      artist: "พริษฐ์พงค์ ชุ่มชื่น" ,
      noumber: "1",
      description: "หญิงสาวที่แสนเศร้าเพราะรับประทานเพื่อนตนเอง เป็นศิลปะแบบตัดทอน ต้นแบบจากศิลปิน Picasso แนวทางสร้างภาพ ใช้เส้นและรูปร่างต่าง ๆ เช่น วงรี สี่เหลี่ยม สามเหลี่ยม เส้นโค้ง", 
      
    },

    { 
      image: "21", 
      artname: "Geisha", 
      artist: "นภษภร ศักดิ์ทอง" ,
      noumber: "20",
      description: "Inspiration และเกม Identity v จากตำนานปีศาจที่แปลงกายเป็นหญิงสาวหรือเกอิชาเพื่อล่อลวงเหยื่อให้ลุ่มหลงแล้วจับ eat สร้างศิลปะแบบลดทอนตามศิลปิน และรูปแบบปิกัสโซ", 
      
    },

    { 
      image: "22", 
      artname: "color - peaceful", 
      artist: "วีรวิชญ์ สงค์ประเสริฐ" ,
      noumber: "6",
      description: "ความอิสระและสีสันที่ดูสบายตา ความสบายใจ ได้รับแรงบันดาลใจจาก picasso มีทัศนะธาตุ รูปร่าง เส้น สี จุด โทนร้อน โทนเย็น", 
      
    },

    { 
      image: "23", 
      artname: "CARNIVAL", 
      artist: "เมลาณี เฟื่องเพียร" ,
      noumber: "17",
      description: "งานเทศกาลหน้ากาก circus โดยใช้เทคนิคตัดทอนแบบ Picasso", 
      
    },

    { 
      image: "24", 
      artname: "Caine & Bubble", 
      artist: "วาณิชการ ใหม่อารินทร์" ,
      noumber: "40",
      description: "ได้รับแรงบัลดาลใจมาจากอนิเมชั่นเรื่อง “The Amazing Digital Circus “ คุณจะได้รู้จักเคนผู้นำละครสัตว์และบับเบิ้ลคู่หูของเขา ที่พาคุณไปรู้จักกับเพื่อนใหม่ ได้แก่ เจ็กซ์ รากาต้า คิง ซูเบิล แกงเกิบ ร่วมผจญภัย และค้นหาปริศนาไปกับพวกเขาในโลกแห่งละครสัตว์ และการแสดงสุดมหัศจรรย์ที่วุ่นวาย", 
      
    },

    { 
      image: "25", 
      artname: "BEG FOR THE MOON (ร้องขอสิ่งที่เป็นไปไม่ได้)", 
      artist: "สิริปรียา วงค์คำมูล" ,
      noumber: "14",
      description: "ได้แรงบันดาลใจมาจากหนังเรื่องหนึ่งที่เกี่ยวกับความรักที่เป็นการรอคอยและก็เอาแรงบันดาลใจมาจากชีวิตของแม่ด้วย ถึงจะรู้ว่าคนรักไม่มีชีวิตอยู่แต่ก็ยังที่จะรอคอยเขาให้กลับมา สร้างศิลปะลดทอนตามศิลปิน Picasso", 
      
    },

    { 
      image: "26", 
      artname: "Alan Walker", 
      artist: "ชาญประวิทย์ พิบูลอาลักษณ์" ,
      noumber: "32",
      description: "สีเทาหมายถึงความรู้สึก สีเหลืองหมายถึงความสดใส ผู้หญิงหมายถึงจิตใจ สีชมพูหมายถึงความรัก วาดภาพตามความรู้สึกของผู้หญิงคนหนึ่ง ที่เจออะไรมากมาย และการแสดงออก", 
      
    },

    { 
      image: "27", 
      artname: "อนันต์ Love of someone", 
      artist: "สิริรัตน์ สีพรรณ์" ,
      noumber: "41",
      description: "ความรักที่ไม่สมบูรณ์แบบ ฝ่ายหนึ่งรักมากอีกฝ่ายรักน้อย ลูกไม่ใช่พยานรักเสมอไป ( ผู้หญิงท้อง ) ใช้เทคนิคลดทอนตามศิลปินปิกัสโซ", 
      
    },

    { 
      image: "28", 
      artname: "หญิงสาวผู้น่าหลงใหล", 
      artist: "พัชรกันย์ ปินตา" ,
      noumber: "45",
      description: "หญิงสาวที่หน้าตางดงาม ยืนถ่ายรูปโดยเห็นดวงตาข้างเดียว และมีผมปิดดวงตาอีกข้างหนึ่งของเธอไว้ ทำให้มองเห็นเสน่ห์และความน่าหลงใหลที่ซ่อนอยู่ในตัวเธอ ด้วยการลดทอนแบบศิลปิน Picasso", 
      
    },

    { 
      image: "29", 
      artname: "วัฏจักรโลก", 
      artist: "ชัยวัฒน์ ฝั้นอ้าย" ,
      noumber: "11",
      description: "วาดภาพการฝันเปลี่ยนของเวลาการเกิดกลางวันกลางคืน", 
      
    },

    { 
      image: "30", 
      artname: "ล็อกเก็ตฮาร์ท", 
      artist: "ลมัทณา ศรีธนูชัย" ,
      noumber: "12",
      description: "ผู้หญิงที่มีความลับอะไรบางอย่างซ่อนอยู่ในใจ ไม่สามารถพูดออกมาได้ ถึงแม้ว่าภายนอกเธอจะดูเป็นคนชอบเปิดเผย ดูเข้าถึงง่าย แต่ก็ยังมีบางสิ่งที่เธอไม่สามารถโชว์หรือบอกได้และพื้นหลังนั้น แทนสิ่งที่เธอต้องเจอในแต่ละวันซึ่งแต่ละวันก็ไม่เหมือนกัน โดยใช้เทคนิคการลดทอนภาพจากศิลปิน Picasso", 
      
    },

    { 
      image: "31", 
      artname: "รัชกาลที่ 6 เวชิราวุธกับท้องฟ้าแสนสดใจ", 
      artist: "จิรวศิน พรหมมินทร์" ,
      noumber: "39",
      description: "รัชกาลที่ 6 นั้นได้มองดูท้องฟ้าแสนสดใสอยู่ตรงที่หน้าต่างราชวัง", 
      
    },

    { 
      image: "32", 
      artname: "เพชรหลากสี", 
      artist: "ปภัสสร หวาหลิงต๊ะ" ,
      noumber: "31",
      description: "ภาพขอบเพชรที่มีความหลากสี ในท่ามกลางรูปทรงต่างๆที่มีหลากสีเหมือนกัน", 
      
    },

    { 
      image: "33", 
      artname: "พระเยซูผู้มาช่วยโลก", 
      artist: "ศุภกฤษ์ ทิพย์เดโช " ,
      noumber: "44",
      description: "ชายที่จะมาไถ่บาปให้โลก เปรอะเปื้อนและเป็นภาพแนวตัดทอนภาพ จากจิตกรปิกัสโซ", 
      
    },

    { 
      image: "34", 
      artname: "บิดเบี้ยว แตกสลาย", 
      artist: "สุวิชาดา จันทร์เป็ง" ,
      noumber: "5",
      description: " ค่านิยมและมาตรฐานในปัจจุบันทำให้ผู้คนสูญเสียตัวตนและความเป็นตัวเองไป จากภาพฝั่งซ้ายจะสื่อถึงบุคลิกที่แตกเป็นเสี่ยง ๆ และความไม่สมประกอบสื่อถึงการสูญเสียบุคลิกภายนอกและความต้องการที่จะเป็นอย่างใดอย่างหนึ่งเพื่อให้ผู้อื่นพอใจ รูปตาและปากด้านหลังสื่อถึงสังคมที่คอยพูดจาสบประมาท ภาพฝั่งขวาคือภายในจิตใจที่มีแต่ความสับสนว่าตนเองคือใคร เพราะสูญเสียความเป็นตนเอง ส่วนลายเส้นนั้น ภาพซ้ายใช้เส้นตรงและสีโทนร้อนสื่อถึงความรุนแรงของ standard ค่านิยมทางสังคม ภาพฝั่งขวาใช้สีโทนเย็นและม่วง ใช้เส้นโค้งเป็นส่วนใหญ่ แต่ก็จะมีเส้นตรงผสมด้วยสื่อถึงความสับสนวุ่นวายในจิตใจ สร้างศิลปะแบบลดทอนตามศิลปิน Picasso", 
      
    },

    { 
      image: "35", 
      artname: "บาปแรกของมนุษย์", 
      artist: "อัจจิมา ปันธนนันท์" ,
      noumber: "34",
      description: "อดัม เอวา ( มนุษย์คู่แรก ) พื้นหลังเป็นบาปต่างๆที่ทำ", 
      
    },

    { 
      image: "36", 
      artname: "ธรรมดา", 
      artist: "จีรภัทร วงศ์ศิริวิวัฒน์" ,
      noumber: "2",
      description: "ได้รับแรงบันดาลใจจาก Picasso ในภาพ looking at my betty rose เขาได้ถ่ายทอดอารมณ์ความศิลปิน,ความจริงผ่านดวงตาและมีเส้นตรงเป็นองค์ประกอบหลัก จึงได้นำมาปรับใช้ โดยถ่ายทอดความรู้สึกอ่อนไหวผ่านตัวผู้หญิงและควันบุหรี่ ทัศนะธาตุคือ เลือกใช้เส้นโค้งอิสระเป็นองค์ประกอบหลัก โทนสีที่ใช้ในตัวผู้หญิงเป็นสีโทนร้อนเพื่อแสดงถึงความมีชีวิต พื้นหลังเป็นสีโทนเย็นแสดงถึงความเครียด ความเศร้า ความหมดหวัง", 
      
    },

    { 
      image: "37", 
      artname: "เทพธิดาผู้โศกเศร้า", 
      artist: "ปฏิภาน มูชัย" ,
      noumber: "37",
      description: "วาดผู้หญิงใส่ชุดเทพธิดาสื่อความเป็นไทยให้เอียงคอเพื่อแสดงความโศกเศร้า ใช้เส้นโค้งไม่เป็นรูปร่างแสดงความลึกลับงุนงง", 
      
    },

    { 
      image: "38", 
      artname: "ดอกไม้ที่อยู่ในแจกัน", 
      artist: "ริชชขวัญ หมื่นณรงค์" ,
      noumber: "36",
      description: "เป็นผลงานที่ผมคิดขึ้นได้เป็นอย่างแรกที่ครูสั่งงานผมเลยวาดมันขึ้นมาตามความคิดของผม ตามผลงานของ picasso", 
      
    },

    { 
      image: "39", 
      artname: "ชายผู้ซ่อนความรู้สึก", 
      artist: "คุณานนต์ ใจคำ" ,
      noumber: "13",
      description: "เด็กชายผู้ซ่อนความรู้สึกที่แท้จริง คือเบื้องหน้าอาจจะเป็นคนที่ร่าเริงสดใสมีความสุขแต่เบื้องหลังอาจจะกำลังเศร้าอยู่ข้างในใจ", 
      
    },

    { 
      image: "40", 
      artname: "กลับด้าน", 
      artist: "ณัฐวุฒิ นิธิอุดมฤทธิ์" ,
      noumber: "10",
      description: "เป็นผลงานที่ผมคิดขึ้นมาตอนที่ได้นึกถึงแจกันและแก้วใส่น้ำที่ร้านกาแฟ ผมเลยวาดขึ้นมาตามแนวคิดของผมตามผลงานของ Picasso", 
      
    },

    { 
      image: "41", 
      artname: "กล่องปริศนา", 
      artist: "กานต์ ดำมี" ,
      noumber: "28",
      description: "ภายนอกเป็นเพียงกล่องธรรมดาแต่ภายในเป็นสิ่งที่ยังไม่ถูกเปิดเผย", 
      
    },

    { 
      image: "42", 
      artname: "3 flower", 
      artist: "พิชญธิดา บุญเปี่ยมเลิศ" ,
      noumber: "21",
      description: "เป็นผลงานที่คิดขึ้นมาจากภาพ Sun flower5 ของแวนโก๊ะ โดยนำมาวาดในแนวของ Picasso ในแนวสีที่แตกต่างกัน", 
      
    },

    { 
      image: "43", 
      artname: "1 Life many side", 
      artist: "นภัชพร บัวลอย" ,
      noumber: "19",
      description: "คนเรามีชีวิตได้ 1 ชีวิต แต่ตั้งแต่เด็กจนโตความคิดของเราจะเปลี่ยนไปตามวัยและสิ่งแวดล้อมรอบตัวเรา ทำให้เรามีความคิดหลากหลายด้าน และหลายตัวตน ที่ไม่ได้เปิดเผยออกมาทั้งด้านดีและด้านมืด ดังนั้นเราอย่าไว้ใจคนง่าย", 
      
    },

    { 
      image: "44", 
      artname: "mermaid midnight", 
      artist: "พิชญา พิทักษ์" ,
      noumber: "22",
      description: "เป็นภาพเงือกสาวที่ปรากฏตัวขึ้นในเวลากลางคืนท่ามกลางมหาสมุทร ให้ความรู้สึกหลงใหลสะกดตาและอ้างว้างในเวลาเดียวกัน ตามงานสไตล์ Picasso", 
      
    },

    { 
      image: "45", 
      artname: "ตามหาตัวตนของผีเสื้อ", 
      artist: "พรไพลิน สมุทรีรัมย์" ,
      noumber: "8",
      description: "ได้แรงบันดาลใจมาจากคนเรามีหลายตัวตนเหมือนผีเสื้อที่มีหลายสีแต่เราก็ต้องตามหาตัวตนที่แท้จริงของตัวเราเองให้เจอ", 
      
    },

    
  ];

  

  // Function to dynamically generate artwork cards
  function generateArtworkCards() {
    const artworksRow = document.getElementById('artworksRow');
    artworksRow.innerHTML = ''; // Clear existing content
    
    //${artwork.image}
    artworks.forEach((artwork, index) => {
      const cardHtml = `
        <div class="col-md-4 col-lg-3" data-aos="fade-left"  >
          <div class="card mb-4 shadow-sm" >
            <img src="./picasso/${index+1}.jpg" class="card-img-top modal-image" alt="" id="myImg1" style="width: 100%; height: auto;"> 
            <div class="card-body">
              <p class="card-text">${artwork.artname}</p>
              <div class="d-flex justify-content-between align-items-center">
                <small class="text-muted"><b>แนวคิด : </b>${artwork.description}</small>
              </div>
             
            </div>
            <div class="card-footer" >
            <small class="text-body-secondary">${artwork.artist} เลขที่ ${artwork.noumber}</small>
          </div>
          </div>
        </div>
      `;
      artworksRow.innerHTML += cardHtml;
    });
    
  }
  // Call the function to generate artwork cards when the page loads
  window.onload = generateArtworkCards;

  